---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveHeightOffset
source: html/5186c8c1-aa28-3da8-3e2e-995e07661a11.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveHeightOffset Property

"Offset From Base"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveHeightOffset { get; }
```